* Latency tests
  - Router used is a LinksysEA7500
  - Using connections at 2.4 GHz
  - In the router software, priority is given to the feather and the
    computer.
  - The feather (arduino) code is here: [[file:wifiFeather/spongeCode/src/spongeWifiFeatherM0.ino][file:~/docs/quintet/wifiFeather/spongeCode/src/spongeWifiFeatherM0.ino]]
    - One OSC message /sponge containing  13 integers is sent.
    - The first int is 0 or 1, the value of the button.
    - At the end of void loop(), there is a delay of 100 microseconds.
  - The sc code is here: [[file:latencyTest.scd][file:~/docs/quintet/latencyTest.scd]]
    - A 1 kHz sine wave is triggered with the button.
    - It lasts 1 second.
    - It is delayed of 1 second so I can record 
  - Internal sound card and speakers (Thinkpad T530) buffer size at 128, sample rate at 48000
    jack_control eps driver alsa eps realtime True eps realtime-priority 60
    jack_control ds alsa dps device hw:PCH dps capture hw:PCH,0 dps playback hw:PCH,0
    jack_control dps period 128 dps nperiods 2 dps rate 48000
** Variables 
*** Protocol (Wi-Fi, XBee, Bluetooth, other, custom)
*** Router (Wi-Fi only)
    - Manufacturer :: Linksys
    - Model :: EA7500
    - Year :: probably 2016
    - Price :: roughly 200.00 CAD
    - Protocol (b, g, n, ac, ad, ah, aj, ax, ay) :: ac available with router, but n is used.
    - Frequency (2.4 or 5) :: 2.4 (n)
    - Channel :: Set to auto, 2.412 GHz (Channel 1)
    - Security :: WPA2 personal
    - Broadcast SSID :: Yes
    - Number of devices connected to the router :: 2 (computer and Feather M0 with ATWINC1500)
    - Device priority :: Yes
    - Beam forming :: Not sure
    - Number of SSID available in the area :: 17
    - Number of SSID using the same channel (incuding the one we used) :: 4
*** XBee
    - Manufacturer ::
    - Emitter module :: XBee Pro Series 1
    - Receiver module :: XBee Pro Series 1
    - Receiver adapter :: SparkFun USB XBee adapter
    - USB connection :: USB 2.0 port
    - Frequency/channel :: 
*** Bluetooth
    - Version ::
    - Device :: 
*** Computer
    - Computer model :: Lenovo Thinkpad T530
    - CPU :: Intel(R) Core(TM) i7-3520M CPU @ 2.90GHz
    - Operating system :: Arch Linux [2017-07-17 Mon]
    - Network controller :: Intel Corporation Centrino Advanced-N 6205 [Taylor Peak] (rev 34) (Wi-Fi)
    - Audio software (and version) :: SuperCollider 3.8.0
    - Added delay :: 1 second (48000)
    - Audio interface :: HDA-Intel - HDA Intel PCH (internal)
    - Audio driver(s) :: ALSA, Jack
    - Buffer size :: 128 samples, 2 periods
*** Context
    - See output of =iwlist wlp3s0 scan=
    - Mobile phones in range
    - City, apartment, house, institution (university), down town, cell towers, routers, etc.
	

** One feather M0/ATWINC1500, computer uses wifi too (waveform analyzed visually by me)
   |    |          |        |           |
   |----+----------+--------+-----------|
   |  1 |    48509 |    509 | 10.604167 |
   |  2 |    48927 |    927 |   19.3125 |
   |  3 |    48352 |    352 | 7.3333333 |
   |  4 |    48476 |    476 | 9.9166667 |
   |  5 |    48365 |    365 | 7.6041667 |
   |  6 |    48331 |    331 | 6.8958333 |
   |  7 |    48244 |    244 | 5.0833333 |
   |  8 |    48377 |    377 | 7.8541667 |
   |  9 |    48869 |    869 | 18.104167 |
   | 10 |    48413 |    413 | 8.6041667 |
   | 11 |    48361 |    361 | 7.5208333 |
   | 12 |    48296 |    296 | 6.1666667 |
   | 13 |    48413 |    413 | 8.6041667 |
   | 14 |    48624 |    624 |        13 |
   | 15 |    48567 |    567 |   11.8125 |
   | 16 |    48405 |    405 |    8.4375 |
   | 17 |    48398 |    398 | 8.2916667 |
   | 18 |    48322 |    322 | 6.7083333 |
   | 19 |    48370 |    370 | 7.7083333 |
   | 20 |    48620 |    620 | 12.916667 |
   |----+----------+--------+-----------|
   |    | 48461.95 | 461.95 | 9.6239584 |
   #+TBLFM: $3=$2-48000::$4=$3/48::@22$2=vmean(@I..@II)::@22$4=vmean(@I..@II)
** Same audio file, but with reaper's transient detection
   |----+-----------------|
   |  1 | 12.635416666667 |
   |  2 | 17.260416666666 |
   |  3 |   7.32291666667 |
   |  4 | 9.9270833333378 |
   |  5 | 7.5937500000052 |
   |  6 |  6.885416666659 |
   |  7 | 5.1145833333273 |
   |  8 | 8.2187499999939 |
   |  9 | 18.114583333329 |
   | 10 | 8.6562499999978 |
   | 11 | 7.7812500000149 |
   | 12 | 6.4270833333495 |
   | 13 | 8.5729166666795 |
   | 14 | 13.010416666681 |
   | 15 | 11.864583333349 |
   | 16 | 8.4062500000144 |
   | 17 | 8.2812500000173 |
   | 18 | 6.6979166666812 |
   | 19 | 9.3645833333085 |
   | 20 | 12.864583333311 |
   | 21 | 7.4895833333102 |
   | 22 | 11.343749999966 |
   | 23 | 7.3854166666365 |
   | 24 | 8.0520833333111 |
   | 25 | 9.7604166666372 |
   | 26 | 10.343749999976 |
   | 27 | 6.8229166666356 |
   | 28 | 11.093749999972 |
   |----+-----------------|
   |    |       9.5461310 |
   #+TBLFM: @29$2=vmean(@I..@II)

** Same setup, other recording 40 samples
|----+-----------------|
|  1 | 7.4062499999998 |
|  2 | 7.1979166666658 |
|  3 |  7.822916666667 |
|  4 | 9.1145833333375 |
|  5 | 6.5312500000037 |
|  6 | 8.5937500000028 |
|  7 | 7.1979166666623 |
|  8 | 7.8437499999922 |
|  9 | 14.885416666662 |
| 10 | 6.2395833333255 |
| 11 | 6.5937499999933 |
| 12 |  6.822916666664 |
| 13 |  6.489583333348 |
| 14 | 25.864583333352 |
| 15 | 5.5729166666794 |
| 16 | 13.031250000012 |
| 17 | 6.1354166666803 |
| 18 | 6.5729166666841 |
| 19 | 8.4895833333505 |
| 20 | 6.8020833333478 |
| 21 |  7.906250000012 |
| 22 |  7.093750000017 |
| 23 | 7.2395833333516 |
| 24 | 6.8854166666839 |
| 25 | 8.4062500000215 |
| 26 | 7.8020833333028 |
| 27 | 6.0937499999767 |
| 28 | 8.4062499999789 |
| 29 | 7.4062499999741 |
| 30 | 7.7812499999794 |
| 31 | 9.6979166666387 |
| 32 | 5.3645833333036 |
| 33 | 9.5937499999792 |
| 34 | 6.7187499999761 |
| 35 | 5.8854166666436 |
| 36 | 6.3020833333098 |
| 37 | 8.3854166666413 |
| 38 | 8.0312499999735 |
| 39 | 8.5520833332993 |
| 40 | 5.7604166666323 |
|----+-----------------|
|    |       8.1130208 |
|    |                 |
#+TBLFM: @41$2=vmean(@I..@II)

** With 6 Feather M0 ATWINC1500  computer WiFi
|    |                 |
|----+-----------------|
|  1 | 13.239583333333 |
|  2 | 30.572916666666 |
|  3 | 186.51041666666 |
|  4 | 47.697916666673 |
|  5 | 34.489583333338 |
|  6 | 14.614583333337 |
|  7 | 17.406249999993 |
|  8 | 41.072916666661 |
|  9 | 55.406249999994 |
| 10 | 53.822916666661 |
| 11 | 56.552083333326 |
| 12 | 39.322916666659 |
| 13 |  9.156250000018 |
| 14 | 8.8020833333502 |
| 15 |  17.23958333335 |
| 16 | 11.197916666681 |
| 17 | 47.364583333348 |
| 18 | 44.135416666684 |
| 19 | 19.677083333349 |
| 20 | 178.36458333335 |
| 21 | 18.072916666682 |
| 22 | 13.968750000018 |
| 23 | 64.593750000014 |
| 24 |  19.07291666668 |
| 25 | 31.572916666633 |
| 26 | 15.864583333311 |
| 27 | 38.343749999967 |
| 28 |  44.32291666663 |
| 29 | 67.885416666641 |
| 30 | 58.572916666634 |
| 31 | 33.218749999975 |
| 32 | 62.135416666635 |
| 33 | 16.718749999967 |
| 34 | 27.781249999975 |
| 35 | 15.593749999979 |
| 36 | 9.2187499999739 |
| 37 | 57.343749999973 |
| 38 | 211.36458333329 |
| 39 | 17.822916666645 |
| 40 | 18.197916666637 |
| 41 | 31.656249999969 |
| 42 |  8.093749999972 |
| 43 | 22.322916666639 |
| 44 |  22.26041666664 |
|----+-----------------|
|    |       42.105587 |
|    |       44.732498 |
|    |       2000.9964 |
#+TBLFM: @46$2=vmean(@I..@II)::@47$2=vsdev(@I..@II)::@48$2=vvar(@I..@II)

** 

** Computer ethernet 6 feathers
|----+-----------------|
|  1 | 87.427083333333 |
|  2 |       232.09375 |
|  3 | 54.406249999999 |
|  4 | 49.822916666672 |
|  5 | 244.76041666667 |
|  6 | 64.364583333338 |
|  7 | 374.42708333332 |
|  8 | 46.927083333326 |
|  9 | 137.53124999999 |
| 10 | 45.510416666659 |
| 11 |  46.82291666666 |
| 12 | 165.13541666666 |
| 13 | 68.385416666686 |
| 14 | 48.593750000016 |
| 15 | 128.42708333335 |
| 16 | 327.28125000002 |
| 17 | 81.281250000018 |
| 18 | 124.36458333335 |
| 19 | 62.739583333354 |
| 20 | 50.281250000019 |
| 21 | 169.13541666668 |
| 22 | 46.802083333354 |
| 23 | 192.13541666669 |
| 24 | 44.572916666681 |
| 25 | 82.260416666628 |
| 26 | 57.093749999964 |
| 27 | 66.364583333296 |
| 28 | 119.57291666664 |
| 29 |  49.65624999997 |
| 30 | 43.510416666635 |
| 31 |  110.6770833333 |
| 32 |  126.4270833333 |
| 33 | 46.468749999974 |
| 34 | 48.447916666632 |
| 35 |  81.76041666664 |
| 36 | 61.885416666641 |
| 37 | 56.531249999964 |
| 38 | 111.28124999996 |
| 39 | 52.177083333305 |
| 40 | 294.46874999996 |
| 41 | 44.427083333304 |
|----+-----------------|
|    |       106.00584 |
#+TBLFM: @42$2=vmean(@I..@II)
** Computer ethernet 1 feather
|----+-----------------|
|  1 | 6.9062500000001 |
|  2 | 12.239583333333 |
|  3 | 10.552083333333 |
|  4 | 8.6979166666712 |
|  5 |  16.32291666667 |
|  6 | 15.593750000004 |
|  7 |        10.96875 |
|  8 | 11.031249999995 |
|  9 | 11.489583333326 |
| 10 | 11.322916666661 |
| 11 | 73.031249999993 |
| 12 | 28.843749999993 |
| 13 | 77.260416666661 |
| 14 | 16.968750000018 |
| 15 | 59.656250000018 |
| 16 | 84.927083333348 |
| 17 | 82.593750000015 |
| 18 | 64.302083333352 |
| 19 | 10.468750000015 |
| 20 | 66.906250000017 |
| 21 | 12.260416666685 |
| 22 | 114.63541666669 |
| 23 | 48.156250000019 |
| 24 | 19.760416666685 |
| 25 |  23.88541666668 |
| 26 | 9.3645833333511 |
| 27 | 8.5937499999744 |
| 28 | 93.260416666638 |
| 29 | 51.656249999965 |
| 30 | 83.031249999962 |
| 31 |  91.09374999997 |
| 32 | 71.885416666632 |
| 33 | 44.927083333306 |
| 34 | 35.968749999967 |
| 35 | 11.052083333311 |
| 36 | 109.40624999996 |
| 37 |  42.07291666664 |
| 38 | 50.385416666629 |
| 39 | 84.718749999965 |
| 40 |  12.96874999997 |
| 41 |   16.9270833333 |
| 42 | 27.510416666644 |
| 43 | 26.572916666638 |
|----+-----------------|
|    |       41.166909 |
|    |       32.560152 |
#+TBLFM: @44$2=vmean(@I..@II)::@45$2=vsdev(@I..@II)
** Computer Wi-Fi 1 feather (other router nearby)
|----+-----------------|
|  1 | 12.906249999999 |
|  2 | 11.114583333333 |
|  3 | 18.718750000005 |
|  4 | 36.843750000005 |
|  5 | 8.6145833333386 |
|  6 | 63.385416666659 |
|  7 | 59.197916666658 |
|  8 | 32.281249999993 |
|  9 | 62.385416666661 |
| 10 | 21.385416666661 |
| 11 | 58.531249999994 |
| 12 | 23.302083333327 |
| 13 | 123.19791666668 |
| 14 | 96.531250000019 |
| 15 | 93.822916666682 |
| 16 | 60.656250000015 |
| 17 | 34.468750000016 |
| 18 | 28.156250000016 |
| 19 | 32.635416666686 |
| 20 | 37.843750000015 |
| 21 | 14.760416666682 |
| 22 | 47.052083333348 |
| 23 | 29.927083333348 |
| 24 |  11.57291666668 |
| 25 | 74.239583333352 |
| 26 | 11.552083333299 |
| 27 | 65.718749999974 |
| 28 | 42.614583333304 |
| 29 | 47.052083333298 |
| 30 | 51.531249999968 |
| 31 | 66.177083333301 |
| 32 | 47.802083333295 |
| 33 | 48.989583333295 |
| 34 | 24.322916666634 |
| 35 | 51.281249999974 |
| 36 | 44.427083333304 |
| 37 | 22.281249999978 |
| 38 | 36.197916666637 |
| 39 | 118.21874999997 |
| 40 | 179.90624999997 |
|----+-----------------|
|    |       48.790104 |
#+TBLFM: @41$2=vmean(@I..@II)

** sec_5msDelay
|----+-----------------|
|  1 | 11.802083333333 |
|  2 | 10.947916666666 |
|  3 | 14.427083333333 |
|  4 | 8.6770833333372 |
|  5 |  10.01041666667 |
|  6 | 10.468750000005 |
|  7 | 11.489583333326 |
|  8 | 8.4895833333256 |
|  9 | 17.031249999995 |
| 10 | 10.927083333328 |
| 11 | 11.989583333328 |
| 12 | 10.697916666661 |
| 13 | 12.385416666671 |
| 14 |  12.76041666668 |
| 15 | 73.364583333351 |
| 16 | 8.6979166666836 |
| 17 | 5.6979166666835 |
| 18 | 11.281250000017 |
| 19 | 9.5729166666843 |
| 20 | 9.6145833333452 |
| 21 | 8.9687500000153 |
| 22 | 12.197916666679 |
| 23 | 11.489583333351 |
| 24 | 12.802083333348 |
| 25 |  8.510416666681 |
| 26 | 7.8854166666389 |
| 27 | 13.135416666643 |
| 28 | 12.135416666638 |
| 29 | 10.885416666639 |
| 30 | 12.989583333308 |
| 31 | 6.9479166666326 |
| 32 | 7.2395833333019 |
| 33 | 9.4062499999694 |
| 34 | 7.8854166666389 |
| 35 | 10.906249999977 |
| 36 | 11.593749999975 |
| 37 | 10.635416666645 |
| 38 | 7.7395833333043 |
| 39 | 12.468749999968 |
| 40 | 11.885416666644 |
| 41 | 12.760416666637 |
| 42 | 12.843749999973 |
| 43 | 9.8854166666342 |
| 44 | 13.572916666632 |
| 45 | 6.9895833333078 |
|----+-----------------|
|    |       12.090972 |
|    |       9.6098515 |
#+TBLFM: @46$2=vmean(@I..@II)::@47$2=vsdev(@I..@II)

** sec_1msDelay
|----+-----------------|
|  1 | 6.3437500000001 |
|  2 | 7.3437499999991 |
|  3 | 9.0520833333327 |
|  4 | 10.302083333332 |
|  5 | 8.7812500000011 |
|  6 | 10.656250000004 |
|  7 | 5.1562500000042 |
|  8 | 8.4062500000037 |
|  9 | 8.0104166666715 |
| 10 | 8.4895833333309 |
| 11 | 42.406249999992 |
| 12 | 10.552083333327 |
| 13 | 5.1354166666613 |
| 14 | 6.0729166666604 |
| 15 | 11.364583333329 |
| 16 | 8.4895833333256 |
| 17 | 8.1562499999954 |
| 18 | 9.1979166666611 |
| 19 | 18.885416666659 |
| 20 | 33.385416666682 |
| 21 | 9.7812500000174 |
| 22 | 6.2395833333468 |
| 23 | 8.2395833333493 |
| 24 | 8.8229166666807 |
| 25 | 21.281250000015 |
| 26 | 8.5312500000185 |
| 27 | 6.6770833333507 |
| 28 | 6.1770833333483 |
| 29 | 41.802083333351 |
| 30 | 10.031250000019 |
| 31 | 9.4062500000121 |
| 32 | 9.6770833333508 |
| 33 | 7.7395833333469 |
| 34 | 6.6562500000131 |
| 35 | 8.8229166666807 |
| 36 | 9.5937499999792 |
| 37 | 7.1354166666424 |
| 38 | 34.614583333308 |
| 39 | 10.572916666632 |
| 40 | 8.7604166666324 |
| 41 | 8.3020833333052 |
| 42 |  41.84374999997 |
| 43 | 23.260416666645 |
| 44 | 91.531249999974 |
| 45 | 7.6562499999682 |
|----+-----------------|
|    |       14.429861 |
|    |       15.492691 |
#+TBLFM: @46$2=vmean(@I..@II)::@47$2=vsdev(@I..@II)

** sec_100usDelay
|----+-----------------|
|  1 | 6.8229166666667 |
|  2 | 9.4479166666659 |
|  3 | 48.239583333332 |
|  4 | 12.072916666666 |
|  5 | 7.4479166666688 |
|  6 | 9.1354166666715 |
|  7 | 10.885416666671 |
|  8 | 7.6562500000037 |
|  9 | 7.8437500000046 |
| 10 |  8.968749999994 |
| 11 | 8.8437499999934 |
| 12 | 8.5312499999937 |
| 13 | 7.0104166666596 |
| 14 | 8.3437499999945 |
| 15 | 9.8645833333286 |
| 16 | 8.6979166666588 |
| 17 | 6.7812499999924 |
| 18 |  7.447916666667 |
| 19 | 9.1770833333484 |
| 20 | 7.6770833333484 |
| 21 | 11.447916666683 |
| 22 | 11.593750000017 |
| 23 | 8.7604166666821 |
| 24 | 8.4687500000129 |
| 25 | 9.1145833333499 |
| 26 | 8.4479166666824 |
| 27 |  6.489583333348 |
| 28 | 6.5520833333466 |
| 29 | 8.3437500000159 |
| 30 | 6.1562500000178 |
| 31 | 8.0729166666842 |
| 32 | 8.4479166666824 |
| 33 | 6.0937500000122 |
| 34 | 8.7812500000126 |
| 35 | 12.239583333326 |
| 36 | 8.4895833333007 |
| 37 | 29.260416666631 |
| 38 | 7.1145833333048 |
| 39 | 7.7604166666418 |
| 40 | 7.1562499999658 |
| 41 | 7.6979166666433 |
| 42 | 8.6354166666354 |
| 43 | 8.3020833333052 |
| 44 | 9.0312499999783 |
| 45 | 66.906249999974 |
|----+-----------------|
|    |       11.116898 |
|    |       10.876592 |
#+TBLFM: @46$2=vmean(@I..@II)::@47$2=vsdev(@I..@II)


** -sec_5msDelay
|----+-----------------|
|  1 | 8.1145833333331 |
|  2 | 10.989583333333 |
|  3 | 10.802083333332 |
|  4 | 8.6354166666656 |
|  5 | 41.343750000003 |
|  6 | 7.5520833333371 |
|  7 | 11.052083333338 |
|  8 | 8.0312500000037 |
|  9 |  8.177083333333 |
| 10 | 13.072916666662 |
| 11 | 7.8020833333277 |
| 12 | 8.2187499999939 |
| 13 | 9.6145833333274 |
| 14 | 11.260416666662 |
| 15 | 8.8020833333289 |
| 16 | 12.322916666662 |
| 17 | 5.8437500000181 |
| 18 | 13.739583333347 |
| 19 | 8.8437500000182 |
| 20 | 13.406250000017 |
| 21 | 13.656250000018 |
| 22 | 12.218750000017 |
| 23 | 9.5937500000147 |
| 24 | 8.4479166666824 |
| 25 | 6.3854166666815 |
| 26 | 11.239583333349 |
| 27 | 11.968750000015 |
| 28 | 12.927083333345 |
| 29 |  7.864583333351 |
| 30 | 25.635416666681 |
| 31 | 78.156250000021 |
| 32 | 13.697916666679 |
| 33 | 11.385416666684 |
| 34 |  13.65624999999 |
| 35 | 7.7604166666418 |
| 36 | 7.9895833333126 |
| 37 | 26.177083333309 |
| 38 | 8.7187499999715 |
| 39 | 13.093749999967 |
| 40 | 11.031249999974 |
| 41 | 9.6562499999777 |
|----+-----------------|
|    |       13.387449 |
|    |       12.101485 |
#+TBLFM: @42$2=vmean(@I..@II)::@43$2=vsdev(@I..@II)
** -sec_1msDelay
|----+-----------------|
|  1 | 4.0937500000002 |
|  2 | 6.1979166666659 |
|  3 | 11.177083333332 |
|  4 | 10.072916666666 |
|  5 | 8.2604166666709 |
|  6 | 8.3437500000052 |
|  7 | 6.4687500000051 |
|  8 | 6.4062500000048 |
|  9 | 10.302083333338 |
| 10 | 8.3854166666679 |
| 11 |  6.885416666659 |
| 12 | 31.781249999995 |
| 13 | 7.5520833333265 |
| 14 | 6.1145833333285 |
| 15 | 7.8020833333277 |
| 16 | 7.9062499999942 |
| 17 | 8.8020833333289 |
| 18 | 9.3229166666617 |
| 19 | 7.8645833333262 |
| 20 | 7.1979166666765 |
| 21 | 8.4895833333505 |
| 22 |  9.281250000015 |
| 23 | 9.6145833333452 |
| 24 | 9.6145833333452 |
| 25 |  8.427083333352 |
| 26 | 8.2187500000117 |
| 27 | 9.5104166666786 |
| 28 | 7.9895833333481 |
| 29 | 7.3020833333501 |
| 30 | 8.8645833333487 |
| 31 | 97.656250000014 |
| 32 |  74.92708333335 |
| 33 |   6.44791666668 |
| 34 | 7.5520833333513 |
| 35 | 8.6562500000156 |
| 36 | 10.489583333346 |
| 37 | 19.281249999992 |
| 38 | 10.635416666645 |
| 39 | 6.2395833333113 |
| 40 | 9.5937499999792 |
| 41 | 8.4895833333007 |
| 42 | 9.0104166666407 |
| 43 | 8.6979166666339 |
| 44 |  22.59374999997 |
| 45 | 9.7604166666372 |
| 46 | 8.3437499999661 |
|----+-----------------|
|    |       12.752717 |
|    |       16.648892 |
#+TBLFM: @47$2=vmean(@I..@II)::@48$2=vsdev(@I..@II)
** -sec_100usDelay
|----+-----------------|
|  1 | 8.3229166666665 |
|  2 | 7.8229166666657 |
|  3 | 6.8437499999989 |
|  4 | 9.7395833333325 |
|  5 |   8.07291666667 |
|  6 |  7.385416666672 |
|  7 | 7.5520833333371 |
|  8 | 9.8854166666715 |
|  9 | 10.427083333338 |
| 10 | 6.9895833333256 |
| 11 | 9.2395833333256 |
| 12 | 8.4479166666611 |
| 13 | 12.968749999995 |
| 14 | 10.822916666662 |
| 15 | 11.739583333327 |
| 16 | 7.9062499999942 |
| 17 | 7.9687499999928 |
| 18 |  8.989583333328 |
| 19 | 9.8229166666783 |
| 20 | 6.5520833333466 |
| 21 | 10.447916666685 |
| 22 | 7.1979166666836 |
| 23 | 11.406250000014 |
| 24 | 8.4895833333505 |
| 25 | 12.468750000018 |
| 26 | 6.9687500000128 |
| 27 | 8.0937500000147 |
| 28 | 25.989583333349 |
| 29 | 9.5312500000162 |
| 30 | 28.822916666684 |
| 31 | 6.8020833333478 |
| 32 |  32.23958333335 |
| 33 | 10.052083333349 |
| 34 | 12.177083333349 |
| 35 | 8.2187500000046 |
| 36 | 8.4479166666398 |
| 37 | 8.2604166666442 |
| 38 | 7.9270833332998 |
| 39 | 8.1979166666457 |
| 40 | 24.718749999977 |
| 41 | 16.072916666644 |
| 42 | 8.8020833333076 |
| 43 | 14.302083333305 |
| 44 | 12.552083333304 |
| 45 | 8.4270833333022 |
| 46 | 14.197916666646 |
| 47 | 11.677083333311 |
| 48 | 10.968749999975 |
| 49 | 10.072916666644 |
| 50 | 7.5520833333087 |
|----+-----------------|
|    |       10.971667 |
|    |       5.5514115 |
#+TBLFM: @51$2=vmean(@I..@II)::@52$2=vsdev(@I..@II)

** -sec_100usDelay (more data)
   There seemed to be a deeper issue here.  All Feathers were
   disconnected from router at some point.

|----+-----------------|
|  1 | 8.5729166666657 |
|  2 | 140.69791666667 |
|  3 | 48.656249999999 |
|  4 | 32.302083333335 |
|  5 | 89.781250000005 |
|  6 | 49.031250000006 |
|  7 | 27.656250000005 |
|  8 | 27.781250000004 |
|  9 | 32.281249999993 |
| 10 | 127.82291666666 |
| 11 | 6.4270833333282 |
| 12 | 62.760416666659 |
| 13 | 162.13541666666 |
| 14 | 32.114583333325 |
| 15 | 114.34374999999 |
| 16 | 40.364583333325 |
| 17 | 40.635416666678 |
| 18 | 119.86458333335 |
| 19 | 36.677083333352 |
| 20 | 119.71875000002 |
| 21 | 27.531250000017 |
| 22 | 51.906250000016 |
| 23 | 325.36458333335 |
| 24 | 41.385416666685 |
| 25 |  9.156250000018 |
| 26 | 45.760416666681 |
| 27 | 34.968750000019 |
| 28 | 52.218750000016 |
| 29 | 46.447916666686 |
| 30 | 15.489583333348 |
| 31 | 39.114583333351 |
| 32 |  12.13541666668 |
| 33 | 22.947916666681 |
| 34 | 29.447916666641 |
| 35 | 56.760416666634 |
| 36 |  14.11458333331 |
| 37 | 89.864583333295 |
| 38 | 14.656249999973 |
| 39 | 31.614583333308 |
| 40 | 32.364583333305 |
| 41 | 140.44791666663 |
| 42 | 77.468749999966 |
| 43 | 94.510416666637 |
| 44 | 101.26041666663 |
| 45 | 62.364583333306 |
| 46 |  96.01041666663 |
| 47 | 103.51041666664 |
| 48 |   68.6145833333 |
| 49 | 9.9895833333079 |
| 50 | 43.385416666638 |
| 51 | 89.885416666633 |
| 52 | 75.947916666635 |
| 53 | 28.281249999978 |
| 54 | 38.010416666637 |
| 55 | 58.239583333304 |
| 56 | 69.906249999974 |
| 57 | 124.01041666664 |
| 58 | 124.90624999997 |
| 59 | 35.781249999971 |
| 60 | 42.552083333305 |
| 61 | 49.156249999967 |
| 62 | 333.21874999996 |
| 63 | 64.031249999971 |
| 64 | 60.843749999961 |
| 65 | 52.864583333331 |
|----+-----------------|
|    |       67.047276 |
#+TBLFM: @66$2=vmean(@I..@II)





** -sec_100usDelay_moreData (take 2)

|-----+-----------------|
|   1 |        11.09375 |
|   2 |  7.510416666666 |
|   3 | 5.3437499999989 |
|   4 | 10.510416666666 |
|   5 | 11.427083333338 |
|   6 | 34.114583333338 |
|   7 | 12.322916666671 |
|   8 | 11.468750000004 |
|   9 | 21.927083333331 |
|  10 | 8.6562499999943 |
|  11 | 9.6562499999955 |
|  12 | 7.9687499999928 |
|  13 | 12.093749999995 |
|  14 | 21.906249999994 |
|  15 | 10.906249999994 |
|  16 | 26.322916666661 |
|  17 | 36.531249999996 |
|  18 | 12.510416666679 |
|  19 | 8.1979166666812 |
|  20 | 9.3229166666831 |
|  21 |  6.364583333351 |
|  22 | 8.2395833333493 |
|  23 |  7.906250000012 |
|  24 |  15.11458333335 |
|  25 | 7.3020833333501 |
|  26 | 8.2395833333493 |
|  27 | 19.635416666681 |
|  28 | 7.3437500000182 |
|  29 | 6.8854166666839 |
|  30 | 12.927083333345 |
|  31 | 8.1145833333451 |
|  32 | 24.968750000014 |
|  33 | 8.0312500000161 |
|  34 | 8.5312500000114 |
|  35 | 11.010416666636 |
|  36 | 25.302083333301 |
|  37 | 5.4062499999787 |
|  38 | 8.1562499999706 |
|  39 | 6.9062499999717 |
|  40 | 16.510416666634 |
|  41 | 7.9895833333126 |
|  42 | 9.7604166666372 |
|  43 | 13.822916666641 |
|  44 | 8.4062499999789 |
|  45 | 7.4270833333117 |
|  46 | 7.8854166666389 |
|  47 | 8.7604166666324 |
|  48 | 7.4895833333102 |
|  49 | 9.3854166666461 |
|  50 | 90.177083333302 |
|  51 |  9.552083333304 |
|  52 | 28.677083333307 |
|  53 | 23.343749999967 |
|  54 | 11.843749999969 |
|  55 | 8.4062499999789 |
|  56 | 7.5312499999711 |
|  57 | 10.572916666632 |
|  58 | 7.1145833333048 |
|  59 | 9.4062499999694 |
|  60 | 7.1145833333048 |
|  61 |  8.135416666633 |
|  62 | 8.1562499999706 |
|  63 | 7.5937499999696 |
|  64 |  8.135416666633 |
|  65 | 6.9270833333093 |
|  66 | 10.572916666632 |
|  67 | 16.427083333383 |
|  68 | 6.4895833333765 |
|  69 |  9.177083333384 |
|  70 | 39.531250000067 |
|  71 | 7.1354166666993 |
|  72 | 11.510416666709 |
|  73 | 8.7395833333801 |
|  74 | 9.4479166667156 |
|  75 |  50.65625000006 |
|  76 | 13.968750000032 |
|  77 | 15.572916666713 |
|  78 | 11.760416666704 |
|  79 | 9.8645833333819 |
|  80 | 43.593750000042 |
|  81 | 9.5520833333751 |
|  82 | 8.5104166667236 |
|  83 | 7.5937500000407 |
|  84 | 10.572916666717 |
|  85 | 11.177083333365 |
|  86 | 8.2187500000543 |
|  87 | 36.510416666715 |
|  88 | 6.6562500000487 |
|  89 | 11.614583333369 |
|  90 | 4.9895833333835 |
|  91 | 11.927083333376 |
|  92 | 8.6562500000298 |
|  93 | 11.072916666706 |
|  94 | 10.677083333377 |
|  95 |   11.3229166667 |
|  96 | 8.8645833333771 |
|  97 | 8.4270833333733 |
|  98 | 9.9062500000571 |
|  99 | 10.531250000042 |
| 100 | 9.5104166666999 |
| 101 | 8.9687500000366 |
| 102 | 16.135416666714 |
| 103 | 8.3854166666981 |
| 104 | 6.5937500000359 |
| 105 | 10.135416666714 |
|-----+-----------------|
|     |       13.116766 |
|     |       11.282699 |
#+TBLFM: @106$2=vmean(@I..@II)::@107$2=vsdev(@I..@II)

** Summary security and delay
|                 |      mean |      sdev |
|-----------------+-----------+-----------|
| +sec_5msDelay   | 12.090972 | 9.6098515 |
| +sec_1msDelay   | 14.429861 | 15.492691 |
| +sec_100usDelay | 11.116898 | 10.876592 |
| -sec_5msDelay   | 13.387449 | 12.101485 |
| -sec_1msDelay   | 12.752717 | 16.648892 |
| -sec_100usDelay | 10.971667 | 5.5514115 |
